# Common Table Expressions (CTEs) in Oracle SQL

### What is a CTE?
A **Common Table Expression (CTE)** is a temporary result set defined using the `WITH` clause.  
It improves **readability** and **reusability** of queries.

### Query without CTE
Retrieve employees earning more than 3000 directly with a filter.

In [ ]:
SELECT ename, sal, deptno
FROM emp
WHERE sal > 2000
ORDER BY sal DESC;

### Query with CTE
The same query rewritten using a CTE for better readability.

In [ ]:
WITH high_salary AS (
    SELECT ename, sal, deptno
    FROM emp
    WHERE sal > 2000
    ORDER BY sal DESC
)
SELECT * FROM high_salary;

### CTE with Aggregation
Find employees who earn more than the average salary.

In [ ]:
WITH avg_sal AS (
    SELECT AVG(sal) AS avg_salary FROM emp
)
SELECT ename, sal
FROM emp, avg_sal
WHERE emp.sal > avg_sal.avg_salary;

### CTE with CASE Expression
Classify employees into salary categories.

In [ ]:
WITH salary_classification AS (
    SELECT ename,
           sal,
           CASE 
               WHEN sal < 1000 THEN 'Low Salary'
               WHEN sal BETWEEN 1000 AND 3000 THEN 'Average Salary'
               WHEN sal IN (3100, 3200, 3500, 3800) THEN 'High Salary'
               ELSE 'Other Salary'
           END AS salary_category
    FROM emp
)
SELECT * FROM salary_classification;

### CTE with Joins
Combine employee and department details using a CTE.

In [ ]:
WITH emp_dept AS (
    SELECT e.ename, e.sal, d.dname, d.loc
    FROM emp e
    JOIN dept d ON e.deptno = d.deptno
)
SELECT * FROM emp_dept;